In [90]:
import pandas as pd
import numpy as np

In [91]:
np.random.randn(4,3)

array([[ 0.16487667,  1.1346046 ,  1.3133843 ],
       [-0.46983795, -0.6918136 ,  0.56247718],
       [ 0.21166184, -0.56582694,  1.83948162],
       [-0.07797152,  0.64205101, -0.06219641]])

In [92]:
data = np.random.randn(4,3)

In [93]:
data

array([[-2.01390229,  0.71786779, -0.95475712],
       [-0.94924495,  0.04633706, -1.41828065],
       [-0.29779495,  0.82047959, -0.42023362],
       [-0.62932377,  1.73049181, -0.23290801]])

In [94]:
df = pd.DataFrame(data)

In [95]:
df

          0         1         2
0 -2.013902  0.717868 -0.954757
1 -0.949245  0.046337 -1.418281
2 -0.297795  0.820480 -0.420234
3 -0.629324  1.730492 -0.232908

In [96]:
df[0] # 0. kolonu karşımıza getirir

0   -2.013902
1   -0.949245
2   -0.297795
3   -0.629324
Name: 0, dtype: float64

## Indexleme

In [97]:
newDf = pd.DataFrame(data,index=["Irem","Sena","Ismail","Selma"],columns=["Maas","Yas","Calisma Saati"])

In [98]:
newDf

            Maas       Yas  Calisma Saati
Irem   -2.013902  0.717868      -0.954757
Sena   -0.949245  0.046337      -1.418281
Ismail -0.297795  0.820480      -0.420234
Selma  -0.629324  1.730492      -0.232908

In [99]:
newDf["Yas"]

Irem      0.717868
Sena      0.046337
Ismail    0.820480
Selma     1.730492
Name: Yas, dtype: float64

In [100]:
newDf ["Calisma Saati"]

Irem     -0.954757
Sena     -1.418281
Ismail   -0.420234
Selma    -0.232908
Name: Calisma Saati, dtype: float64

In [101]:
newDf [["Maas","Yas"]]

            Maas       Yas
Irem   -2.013902  0.717868
Sena   -0.949245  0.046337
Ismail -0.297795  0.820480
Selma  -0.629324  1.730492

In [102]:
newDf

            Maas       Yas  Calisma Saati
Irem   -2.013902  0.717868      -0.954757
Sena   -0.949245  0.046337      -1.418281
Ismail -0.297795  0.820480      -0.420234
Selma  -0.629324  1.730492      -0.232908

In [103]:
newDf.loc["Irem"]

Maas            -2.013902
Yas              0.717868
Calisma Saati   -0.954757
Name: Irem, dtype: float64

In [104]:
newDf.iloc[1]

Maas            -0.949245
Yas              0.046337
Calisma Saati   -1.418281
Name: Sena, dtype: float64

In [105]:
newDf

            Maas       Yas  Calisma Saati
Irem   -2.013902  0.717868      -0.954757
Sena   -0.949245  0.046337      -1.418281
Ismail -0.297795  0.820480      -0.420234
Selma  -0.629324  1.730492      -0.232908

In [106]:
# yeni bir kolon eklemek için;

In [107]:
newDf["EmeklilikYasi"] = newDf["Yas"] + newDf["Yas"]
newDf

            Maas       Yas  Calisma Saati  EmeklilikYasi
Irem   -2.013902  0.717868      -0.954757       1.435736
Sena   -0.949245  0.046337      -1.418281       0.092674
Ismail -0.297795  0.820480      -0.420234       1.640959
Selma  -0.629324  1.730492      -0.232908       3.460984

In [108]:
#kolon silmek için;
#axis=1  column
#axis=0 row

In [109]:
newDf.drop("EmeklilikYasi",axis=1)

            Maas       Yas  Calisma Saati
Irem   -2.013902  0.717868      -0.954757
Sena   -0.949245  0.046337      -1.418281
Ismail -0.297795  0.820480      -0.420234
Selma  -0.629324  1.730492      -0.232908

In [110]:
newDf

            Maas       Yas  Calisma Saati  EmeklilikYasi
Irem   -2.013902  0.717868      -0.954757       1.435736
Sena   -0.949245  0.046337      -1.418281       0.092674
Ismail -0.297795  0.820480      -0.420234       1.640959
Selma  -0.629324  1.730492      -0.232908       3.460984

In [111]:
#kolon yada satırı kalıcı olarak silmek için;

In [112]:
newDf.drop("EmeklilikYasi", axis=1, inplace=True)

In [113]:
newDf

            Maas       Yas  Calisma Saati
Irem   -2.013902  0.717868      -0.954757
Sena   -0.949245  0.046337      -1.418281
Ismail -0.297795  0.820480      -0.420234
Selma  -0.629324  1.730492      -0.232908

In [114]:
newDf.loc["Irem","Yas"]

0.7178677901177767

In [115]:
newDf.loc["Irem"]["Yas"]

0.7178677901177767

In [116]:
bf = newDf < 0

In [117]:
newDf[bf]

            Maas  Yas  Calisma Saati
Irem   -2.013902  NaN      -0.954757
Sena   -0.949245  NaN      -1.418281
Ismail -0.297795  NaN      -0.420234
Selma  -0.629324  NaN      -0.232908

In [118]:
newDf[newDf["Yas"] < 0] # böyle filtreleme yapabiliriz

Empty DataFrame
Columns: [Maas, Yas, Calisma Saati]
Index: []

In [119]:
newDf.reset_index()

    index      Maas       Yas  Calisma Saati
0    Irem -2.013902  0.717868      -0.954757
1    Sena -0.949245  0.046337      -1.418281
2  Ismail -0.297795  0.820480      -0.420234
3   Selma -0.629324  1.730492      -0.232908

In [120]:
newDf # yapılan değişikliklerin kalıcı olması için inplace=True demeliyiz

            Maas       Yas  Calisma Saati
Irem   -2.013902  0.717868      -0.954757
Sena   -0.949245  0.046337      -1.418281
Ismail -0.297795  0.820480      -0.420234
Selma  -0.629324  1.730492      -0.232908

In [121]:
newIndeksList= ["abc","bcd","cde","def"]

In [122]:
newDf ["newIndex"] = newIndexList

In [123]:
newDf

            Maas       Yas  Calisma Saati newIndex
Irem   -2.013902  0.717868      -0.954757      abc
Sena   -0.949245  0.046337      -1.418281      bcd
Ismail -0.297795  0.820480      -0.420234      cde
Selma  -0.629324  1.730492      -0.232908      def

In [124]:
newDf.set_index("newIndex", inplace=True)
newDf

              Maas       Yas  Calisma Saati
newIndex
abc      -2.013902  0.717868      -0.954757
bcd      -0.949245  0.046337      -1.418281
cde      -0.297795  0.820480      -0.420234
def      -0.629324  1.730492      -0.232908

In [125]:
newDf.loc["abc"]

Maas            -2.013902
Yas              0.717868
Calisma Saati   -0.954757
Name: abc, dtype: float64

In [127]:
firstIndex = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [128]:
icIndex = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [129]:
birlesmisIndex = list(zip(firstIndex,icIndex))

In [130]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [131]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndexlesmisIndex)

In [132]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [133]:
myCartoon = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [134]:
cartoon = np.array(myCartoon)

In [135]:
cartoonDataFrame = pd.DataFrame(cartoon,index=birlesmisIndex,columns=["Yas","Meslek"])

In [136]:
cartoonDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [137]:
cartoonDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [138]:
cartoonDataFrame.loc["South Park"]

        Yas Meslek
Cartman   9      D
Kenny    10      E
Kyle     11      F

In [139]:
cartoonDataFrame.loc["Simpson"].loc["Marge"]

Yas       30
Meslek     C
Name: Marge, dtype: object

In [140]:
cartoonDataFrame.index.names = ["Film Adı","Isim"]

In [141]:
cartoonDataFrame

                   Yas Meslek
Film Adı   Isim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F